{
  "backend/main.mo": "Motoko canister combining access control and blob storage mixins, with user profile storage and protected query/update methods.",
  "feature_evidence.json": "Feature evidence report listing build‑related tasks, associated components, and verification artifacts.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files including components, hooks, utilities, and build docs.",
  "frontend/BUILD_VERIFICATION.md": "Markdown guide outlining prerequisites and steps for verifying successful frontend builds.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color tokens and light/dark theme variables.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component with theme support, global layout, and page structure.",
  "frontend/src/components/files/FileUploadPanel.tsx": "Authenticated file upload UI with selection, upload mutation handling, and status alerts.",
  "frontend/src/components/files/UploadedFilesList.tsx": "Displays authenticated user’s uploaded files with loading, error, and empty states.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing copyright, attribution, and a dynamic caffeine.ai referral link.",
  "frontend/src/components/layout/GoldenSplit.tsx": "Layout component applying a responsive golden‑ratio split between major and minor sections.",
  "frontend/src/components/layout/Header.tsx": "Header with branding, Internet Identity auth controls, and query cache clearing on sign‑out.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines a placeholder example React Query hook that waits for an actor before running.",
  "frontend/src/hooks/useUserFiles.ts": "Hooks for listing and uploading user files, currently using placeholders until backend methods exist.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables for light and dark modes.",
  "frontend/src/lib/goldenRatio.ts": "Exports golden ratio constants and a helper to convert ratios to percentage strings.",
  "frontend/src/lib/utils.ts": "Utility function for merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/HomePage.tsx": "Home page layout showing features, file upload panels, and hero content, gated by authentication.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/vite-env.d.ts": "Vite environment type definitions.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH theme colors, extended animations, container settings, and typography/container-queries/animate plugins.",
  "project_state.json": "Defines the project’s current state, requirements, issues, and features for a Study Mate Pro app including file uploads, AI processing, and branding notes."
}